app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ok"], ["user_id", 7], ["created_at", "2020-01-13 19:34:26.244087"], ["updated_at", "2020-01-13 19:34:26.244087"]]
---
   def create
      message = current_user.messages.build(message_params)
      if message.save